export interface PageMeta {
	metaTitle: string;
	metaDesc: string;
}
export const home: PageMeta = {
	metaTitle: "Мастерская Подарков - уникальные товары со всей России",
	metaDesc: "Мастерская Подарков - источник необычных подарков для взрослых и детей! Товары ручной работы на заказ, курсы от опытных мастеров! Дарите близким только лучшее🎨"
}
export const become: PageMeta = {
	metaTitle: "Стать партнёром - Мастерская Подарков",
	metaDesc: "Вы креативный человек и умеете что-то делать своими руками? Присоединяйтесь к сообществу Мастерской Подарков! Начните зарабатывать на своём творчестве!🤝"
}
export const auth: PageMeta = {
	metaTitle: "Авторизация - Мастерская Подарков",
	metaDesc: "Мы рады видеть вас на нашей платформе! Пройдите быструю и безопасную авторизацию, чтобы получить доступ к личному кабинету и всем его возможностям!🔒"
}
export const search: PageMeta = {
	metaTitle: "Поиск - Мастерская Подарков",
	metaDesc: "Поиск по сайту Мастерская Подарков. Найдётся всё! Ну, почти всё)"
}

//Закрыты из поиска
export const becomeStepOne: PageMeta = {
	metaTitle: "Регистрация партнёром - Мастерская Подарков",
	metaDesc: "Решили к нам присоединиться? Давно пора уже! Добро пожаловать, мы всегда рады новым партнёрам и после регистрации с вами свяжемся!🤝"
}
export const becomeStepTwo: PageMeta = {
	metaTitle: "Реквизиты - Мастерская Подарков",
	metaDesc: "Решили к нам присоединиться? Давно пора уже! Добро пожаловать, мы всегда рады новым партнёрам и после регистрации с вами свяжемся!🤝"
}
export const becomeStepThree: PageMeta = {
	metaTitle: "Банк - Мастерская Подарков",
	metaDesc: "Решили к нам присоединиться? Давно пора уже! Добро пожаловать, мы всегда рады новым партнёрам и после регистрации с вами свяжемся!🤝"
}
export const vendorStepOne: PageMeta = {
	metaTitle: "Банк - Мастерская Подарков",
	metaDesc: "Решили к нам присоединиться? Давно пора уже! Добро пожаловать, мы всегда рады новым партнёрам и после регистрации с вами свяжемся!🤝"
}
export const vendorStepTwo: PageMeta = {
	metaTitle: "Банк - Мастерская Подарков",
	metaDesc: "Решили к нам присоединиться? Давно пора уже! Добро пожаловать, мы всегда рады новым партнёрам и после регистрации с вами свяжемся!🤝"
}

export const vendorStepThree: PageMeta = {
	metaTitle: "Банк - Мастерская Подарков",
	metaDesc: "Решили к нам присоединиться? Давно пора уже! Добро пожаловать, мы всегда рады новым партнёрам и после регистрации с вами свяжемся!🤝"
}
export const cabinet: PageMeta = {
	metaTitle: "Личный кабинет - Мастерская Подарков",
	metaDesc: "Это ваш личный кабинет. Все ваши данные под надёжной защитой!🔒"
}
export const cabinetSettings: PageMeta = {
	metaTitle: "Настройки - Мастерская Подарков",
	metaDesc: "Это ваш личный кабинет. Все ваши данные под надёжной защитой!🔒"
}
export const cabinetFavourites: PageMeta = {
	metaTitle: "Избранное - Мастерская Подарков",
	metaDesc: "Это ваш личный кабинет. Все ваши данные под надёжной защитой!🔒"
}
export const cabinetCart: PageMeta = {
	metaTitle: "Корзина - Мастерская Подарков",
	metaDesc: "Это ваш личный кабинет. Все ваши данные под надёжной защитой!🔒"
}
export const cabinetMessages: PageMeta = {
	metaTitle: "Мои сообщения - Мастерская Подарков",
	metaDesc: "Это ваш личный кабинет. Все ваши данные под надёжной защитой!🔒"
}